Tekla Open API Reference for Tekla Structures 2025
OBB Constructor (OBB)
 Initializes a new instance of the OBB class.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public OBB(
	OBB obb
)
Public Sub New (
	obb As OBB
)
Parameters
obb
Type: Tekla.Structures.Geometry3d.OBB
OBB to be copied.
Exceptions
Exception | Condition
ArgumentException | Thrown when initialization fails.
See Also
Reference
OBB Class
OBB Overload
Tekla.Structures.Geometry3d Namespace